/**
 *****************************************
 * Created by lifx
 * Created on 2018-07-17 21:12:59
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import React from 'react';
import { render } from 'react-dom';
import App from './app';


/**
 *****************************************
 * 渲染组件
 *****************************************
 */
render(<App />, document.getElementById('app'));


/**
 *****************************************
 * 启用热更新
 *****************************************
 */
if (module.hot) {
    module.hot.accept('./app', () => {
        render(<App />, document.getElementById('app'));
    });
}
